app/controllers/universities_controller.rb

	def new
		@country=Country.all
---
SELECT `countries`.* FROM `countries`

	def retrieve_cities
		@cities = City.where(:country_id => params[:country_id])
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`country_id` = 1

	def retrieve_universities
		@universities = University.where(:city_id => params[:city_id])
---
SELECT `universities`.* FROM `universities` WHERE `universities`.`city_id` = 5