app/controllers/universities_controller.rb

SELECT `countries`.* FROM `countries`
---
	def index
		@country=Country.all