app/views/universities/new.html.haml

SELECT `countries`.* FROM `countries`
---
Country:
= select_tag "Country", options_from_collection_for_select(@country, "id", "name"), :prompt => "Select a Country", :onchange => "load_city(this.value)"